chat_system_1309534258_actor_description=Rotten Hake. Robbers' leader.
chat_system_1309534258_snap_0_question=^?^Hey, what did the Royal Treasure Searcher forget in our forest? Are there any treasures hidden around here, or some entrance to an ancient temple?
chat_system_1309534258_snap_0_answer_0=^?^According to the laws of Darion, you have been sentenced to death for slave trading. Do you have anything to say in your defense?
chat_system_1309534258_snap_1_question=^?^You figured me out at last! You've become quite a good bloodhound there, [player]. I knew I shouldn't get involved in this stuff. How did you figure it out, anyway?<br>Ah I get it. My people told me that you just returned from the islands. You must have met James there, right?<br>Please try to understand, I had no choice. I'm not a murderer, set on slaughtering defenseless dwarves. Slavery for them was the better way out. They had to disappear forever. The baron made it pretty clear for me.
chat_system_1309534258_snap_1_answer_0=^?^Wait a minute, what baron? I thought you were the only person involved in this.
chat_system_1309534258_snap_2_question=^?^Understand me right - I'm not even that interested in the slave trade! Listen here...<br>One day Baron Ahey, the new owner of the Creiston Mines, he came to me. He promised me a pile of money for a little spot of work - I just had to rob this cart. I gave him some of my people to help. How was I supposed to know it was gonna be the dwarven ambassador? When I finally figured out what I got myself into, it was way too late to back out.<br>The baron ordered me to kill all of them, but... well we ain't murderers, [player]. The dwarves who survived the assault were sold to the Islands. Lucky James was looking for workers to work in the mines, and I decided - well, it's better for them to become slaves than to die...
chat_system_1309534258_snap_2_answer_0=^?^Well that's a gloomy story. It's not just slave trading, but it's conspiracy too. It's because of you that the war with Kordar began.
chat_system_1309534258_snap_3_question=^?^You think I don't know that? I just figured it out too late. The idea was that the baron could buy out the Creiston Mines from the king, because it looked like the dwarves stopped paying the rent.<br>You see, the rent was in those carts. Ahey got the dwarves' gold, and the mines at the same time. Clever guy, that Ahey. Ah, but he involved me in it too. As a reward I got thirty dwarves I had to kill, and I had to promise that nobody's gonna ever hear about our... you know, what you said, searcher, our... conspiracy.
chat_system_1309534258_snap_3_answer_0=^?^I see... Ok, I won't kill you right now. This situation is complicated. I shall let the king decide your fate - and Ahey's as well.
